{
  "intro": {
    "universal": [
      {
        "speaker": "narrator",
        "text": "The Stellar Concord vessel Dawnseeker detected an anomalous signal from the dead world Vharos."
      },
      {
        "speaker": "narrator",
        "text": "When the crew investigated, a cosmic pulse tore the ship apart."
      },
      {
        "speaker": "narrator",
        "text": "You awaken in the wreckage, alone, surrounded by rust and ruin."
      },
      {
        "speaker": "narrator",
        "text": "The signal still pulses in your mind. Drawing you deeper into the wastes."
      },
      {
        "speaker": "narrator",
        "text": "Something ancient stirs beneath the surface of this dying world."
      },
      {
        "speaker": "narrator",
        "text": "The void remembers. And now, it remembers you."
      }
    ],
    "korvax": [
      {
        "speaker": "narrator",
        "text": "Warning klaxons. Failing systems. The familiar nightmare of malfunction."
      },
      {
        "speaker": "korvax",
        "text": "Thermal regulator critical. Core temperature exceeding safe parameters."
      },
      {
        "speaker": "narrator",
        "text": "Your cybernetic systems spark and stutter. Something in the crash broke you further."
      },
      {
        "speaker": "narrator",
        "text": "But broken things can still fight. Broken things can still survive."
      },
      {
        "speaker": "korvax",
        "text": "Systems... online. Barely. Time to move."
      },
      {
        "speaker": "narrator",
        "text": "The Ironspine Wastes stretch before you. Rust and ruin as far as the eye can see."
      }
    ],
    "lyria": [
      {
        "speaker": "narrator",
        "text": "Time fractures around you. Past and future blur into a single screaming moment."
      },
      {
        "speaker": "lyria",
        "text": "I've seen this before. Or will I see it? The timelines are... wrong."
      },
      {
        "speaker": "narrator",
        "text": "Your temporal abilities, once controlled, now surge beyond your grasp."
      },
      {
        "speaker": "narrator",
        "text": "Vharos amplifies what you are. And what you are terrifies you."
      },
      {
        "speaker": "lyria",
        "text": "Focus. One timeline at a time. Start with survival."
      },
      {
        "speaker": "narrator",
        "text": "The Eclipse Marsh shimmers with impossible reflections. Your journey begins."
      }
    ],
    "auren": [
      {
        "speaker": "narrator",
        "text": "Light. Burning, purifying light. The symbol of everything you abandoned."
      },
      {
        "speaker": "auren",
        "text": "The Order's mark still burns on my soul. Even here. Even now."
      },
      {
        "speaker": "narrator",
        "text": "You left the First Light behind. But faith isn't so easily shed."
      },
      {
        "speaker": "narrator",
        "text": "Vharos tests all beliefs. Especially the ones we try to bury."
      },
      {
        "speaker": "auren",
        "text": "I am no longer a paladin. But I can still protect. I can still atone."
      },
      {
        "speaker": "narrator",
        "text": "The Radiant Highlands glow on the horizon. Calling you home."
      }
    ],
    "shade": [
      {
        "speaker": "narrator",
        "text": "Who are you? The question echoes through fractured memories."
      },
      {
        "speaker": "shade",
        "text": "Another mask. Another mission. But this time... something's different."
      },
      {
        "speaker": "narrator",
        "text": "Faces flicker through your mind. Identities worn and discarded."
      },
      {
        "speaker": "narrator",
        "text": "The crash triggered something. Memories that shouldn't exist. Faces that might be yours."
      },
      {
        "speaker": "shade",
        "text": "The Syndicate wanted me here. But why? What did they know?"
      },
      {
        "speaker": "narrator",
        "text": "The Obsidian Thicket whispers secrets. Some of them might even be true."
      }
    ]
  },
  "actTransitions": {
    "act2": {
      "universal": [
        {
          "speaker": "narrator",
          "text": "The deeper you travel, the more Vharos reveals its true nature."
        },
        {
          "speaker": "narrator",
          "text": "The Seals that bind Xal'Korath grow weaker. You can feel it in your bones."
        },
        {
          "speaker": "narrator",
          "text": "Corruption spreads. Factions grow desperate. And something watches from the void."
        }
      ]
    },
    "act3": {
      "universal": [
        {
          "speaker": "narrator",
          "text": "The Cradle Abyss. Where reality collapses and all paths converge."
        },
        {
          "speaker": "narrator",
          "text": "Xal'Korath stirs in its prison. The World-Eater senses your approach."
        },
        {
          "speaker": "narrator",
          "text": "Every choice has led to this moment. The Pattern waits to be written."
        }
      ]
    }
  }
}
